In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Abhinav", "Rahul", "Shivansh", "Display"],
    "marks" : [93, 4, 66, 33],
    "city" : ["Mumbai", "kalyan", "Madhubani", "Kolkata"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [5]:
df.to_csv("friends.csv")

In [6]:
df.to_csv("friends_indexFalse.csv", index=False)

In [7]:
df.head(2)

      name  marks    city
0  Abhinav     93  Mumbai
1    Rahul      4  kalyan

In [8]:
df.tail(2)

       name  marks       city
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [9]:
df.tail(10)

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [10]:
df.describe()

           marks
count   4.000000
mean   49.000000
std    38.755645
min     4.000000
25%    25.750000
50%    49.500000
75%    72.750000
max    93.000000

In [11]:
train = pd.read_csv("train.csv")

In [12]:
train["Speed"]

0    129
1    123
2    200
3     90
Name: Speed, dtype: int64

In [13]:
train["city"][0]

'Mumbai'

In [14]:
train['city'][3] = "Patna"

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_8252/3634185913.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['city'][3] = "Patna"

In [15]:
train.to_csv("train.csv", index=False)

In [16]:
train

   Tain no.  Speed    city
0    893009    129  Mumbai
1    239843    123   Delhi
2    234323    200    Kota
3    324234     90   Patna

In [17]:
train.index = ["First", "Second", "Third", "Fourth"]

In [18]:
train

        Tain no.  Speed    city
First     893009    129  Mumbai
Second    239843    123   Delhi
Third     234323    200    Kota
Fourth    324234     90   Patna

In [19]:
series = pd.Series(np.random.rand(20))

In [20]:
print(series, type(series))

0     0.622280
1     0.664194
2     0.361714
3     0.719448
4     0.643432
5     0.084894
6     0.430714
7     0.685801
8     0.551663
9     0.213536
10    0.851859
11    0.813171
12    0.967095
13    0.631282
14    0.616555
15    0.617576
16    0.645973
17    0.945172
18    0.849356
19    0.890544
dtype: float64 <class 'pandas.core.series.Series'>

In [21]:
new_df = pd.DataFrame(np.random.rand(445, 6), index=np.arange(445))

In [22]:
new_df.head()

          0         1         2         3         4         5
0  0.921391  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [23]:
new_df.tail()

            0         1         2         3         4         5
440  0.884037  0.597886  0.544405  0.762133  0.125261  0.371775
441  0.939527  0.011641  0.039981  0.146822  0.535565  0.770666
442  0.851114  0.993301  0.061036  0.508179  0.278689  0.207377
443  0.817977  0.630820  0.980287  0.616830  0.207621  0.757789
444  0.429324  0.755577  0.574693  0.744366  0.572660  0.266814

In [24]:
new_df.describe()

                0           1           2           3           4           5
count  445.000000  445.000000  445.000000  445.000000  445.000000  445.000000
mean     0.502499    0.493714    0.499430    0.501626    0.486747    0.523581
std      0.283302    0.290830    0.290262    0.291950    0.273689    0.280872
min      0.002606    0.001512    0.008975    0.001293    0.004836    0.009496
25%      0.260367    0.227204    0.257810    0.246150    0.260478    0.296936
50%      0.530585    0.509196    0.482813    0.493998    0.462239    0.532083
75%      0.742277    0.742295    0.744897    0.759659    0.723544    0.757789
max      0.993430    0.998895    0.997731    0.997309    0.998477    0.991630

In [25]:
print(type(new_df))

<class 'pandas.core.frame.DataFrame'>

In [26]:
new_df[0][0] = "Abhinav"

In [27]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
5    float64
dtype: object

In [28]:
new_df.head()

          0         1         2         3         4         5
0   Abhinav  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [29]:
new_df[0][0] = 0.5

In [30]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [31]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,435,436,437,438,439,440,441,442,443,444
0,0.5,0.500473,0.680977,0.748453,0.990029,0.941996,0.144695,0.036678,0.600133,0.277083,...,0.10592,0.2626,0.705288,0.428054,0.6021,0.884037,0.939527,0.851114,0.817977,0.429324
1,0.050022,0.685561,0.69938,0.791702,0.922096,0.576274,0.118365,0.167078,0.679327,0.05703,...,0.386884,0.233281,0.380009,0.216383,0.242117,0.597886,0.011641,0.993301,0.63082,0.755577
2,0.837252,0.154368,0.821352,0.748612,0.144762,0.646738,0.342959,0.116106,0.457975,0.829709,...,0.261383,0.394789,0.60214,0.802912,0.910003,0.544405,0.039981,0.061036,0.980287,0.574693
3,0.374849,0.516212,0.396508,0.925345,0.805237,0.473066,0.137157,0.887667,0.919147,0.490736,...,0.888894,0.497967,0.915676,0.458148,0.052033,0.762133,0.146822,0.508179,0.61683,0.744366
4,0.97284,0.703049,0.485899,0.195163,0.841767,0.275172,0.974552,0.22255,0.219953,0.606748,...,0.842807,0.286018,0.931792,0.160724,0.272184,0.125261,0.535565,0.278689,0.207621,0.57266
5,0.120565,0.793777,0.118731,0.480371,0.618002,0.722275,0.149801,0.20294,0.962033,0.390634,...,0.459538,0.396332,0.606321,0.262221,0.52365,0.371775,0.770666,0.207377,0.757789,0.266814

In [32]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [33]:
new_df.sort_index(axis=0, ascending=False)

            0         1         2         3         4         5
444  0.429324  0.755577  0.574693  0.744366  0.572660  0.266814
443  0.817977  0.630820  0.980287  0.616830  0.207621  0.757789
442  0.851114  0.993301  0.061036  0.508179  0.278689  0.207377
441  0.939527  0.011641  0.039981  0.146822  0.535565  0.770666
440  0.884037  0.597886  0.544405  0.762133  0.125261  0.371775
..        ...       ...       ...       ...       ...       ...
4    0.990029  0.922096  0.144762  0.805237  0.841767  0.618002
3    0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
2    0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
1    0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
0         0.5  0.050022  0.837252  0.374849  0.972840  0.120565

[445 rows x 6 columns]

In [34]:
new_df.sort_index(axis=1, ascending=True)

            0         1         2         3         4         5
0         0.5  0.050022  0.837252  0.374849  0.972840  0.120565
1    0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2    0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3    0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4    0.990029  0.922096  0.144762  0.805237  0.841767  0.618002
..        ...       ...       ...       ...       ...       ...
440  0.884037  0.597886  0.544405  0.762133  0.125261  0.371775
441  0.939527  0.011641  0.039981  0.146822  0.535565  0.770666
442  0.851114  0.993301  0.061036  0.508179  0.278689  0.207377
443  0.817977  0.630820  0.980287  0.616830  0.207621  0.757789
444  0.429324  0.755577  0.574693  0.744366  0.572660  0.266814

[445 rows x 6 columns]

In [35]:
type(new_df[0])

pandas.core.series.Series

In [36]:
new_df2 = new_df.copy()

In [37]:
new_df2[0][0] = 983
new_df2.head()

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_8252/250112503.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df2[0][0] = 983

          0         1         2         3         4         5
0       983  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [38]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002